Creating own dataframe

In [1]:
import pandas as pd

In [15]:
team = {
    "name" : ["gyanendra","utsav","nripesh"],
    "depart" :["cv","cpp","cv2"],
    "company": ["ab","bc","cd"],
    "id" : [55,65,75]
}

In [55]:
df = pd.DataFrame(team)

In [56]:
df

        name depart company  id
0  gyanendra     cv      ab  55
1      utsav    cpp      bc  65
2    nripesh    cv2      cd  75

In [20]:
df.id

0    55
1    65
2    75
Name: id, dtype: int64

In [21]:
df[['name', 'id']]

        name  id
0  gyanendra  55
1      utsav  65
2    nripesh  75

In [23]:
df.columns

Index(['name', 'depart', 'company', 'id'], dtype='object')

In [25]:
df.iloc[[0,1]]#searching by integer indexing

        name depart company  id
0  gyanendra     cv      ab  55
1      utsav    cpp      bc  65

In [26]:
df.iloc[[0,1],3]

0    55
1    65
Name: id, dtype: int64

In [27]:
df.loc[0]    #searching by labels

name       gyanendra
depart            cv
company           ab
id                55
Name: 0, dtype: object

In [29]:
df.loc[[0,1],['name', 'id']]

        name  id
0  gyanendra  55
1      utsav  65

indexing

In [32]:
df.set_index('company')

              name depart  id
company
ab       gyanendra     cv  55
bc           utsav    cpp  65
cd         nripesh    cv2  75

In [33]:
df.company[0]

'ab'

In [53]:
# df.set_index('company',inplace= True)
# df.reset_index('id',inplace=True)

In [38]:
df.index

Index([55, 65, 75], dtype='int64', name='id')

In [48]:
df['name']

0    gyanendra
1        utsav
2      nripesh
Name: name, dtype: object

In [51]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [57]:
df

        name depart company  id
0  gyanendra     cv      ab  55
1      utsav    cpp      bc  65
2    nripesh    cv2      cd  75

In [58]:
df.sort_index

<bound method DataFrame.sort_index of         name depart company  id
0  gyanendra     cv      ab  55
1      utsav    cpp      bc  65
2    nripesh    cv2      cd  75>

filtering data

In [61]:
df['id'] >= 65

0    False
1     True
2     True
Name: id, dtype: bool

In [62]:
filt = (df['id'] >= 65)

In [63]:
filt

0    False
1     True
2     True
Name: id, dtype: bool

In [65]:
df[filt]

      name depart company  id
1    utsav    cpp      bc  65
2  nripesh    cv2      cd  75

In [67]:
df.loc[filt,'depart']

1    cpp
2    cv2
Name: depart, dtype: object

In [78]:
filt = (df['id'] >= 55) &  (df['name'] == 'gyanendra')

In [79]:
filt

0     True
1    False
2    False
dtype: bool

In [87]:
df.loc[filt, 'company']

0    ab
1    bc
2    cd
Name: company, dtype: object

In [81]:
filt = (df['id'] >= 55) |  (df['name'] == 'gyanendra')

In [82]:
filt

0    True
1    True
2    True
dtype: bool

In [85]:
df.loc[~filt, 'company']

Series([], Name: company, dtype: object)

In [88]:
#modifying the row and columns

In [89]:
df.columns

Index(['name', 'depart', 'company', 'id'], dtype='object')

In [90]:
df.columns = [x.upper() for x in df.columns]
df

        NAME DEPART COMPANY  ID
0  gyanendra     cv      ab  55
1      utsav    cpp      bc  65
2    nripesh    cv2      cd  75

In [98]:
df

        NAME DEPART COMPANY  ID department
0  gyanendra     cv      ab  55         cv
1      utsav    cpp      bc  65        cpp
2    nripesh    cv2      cd  75        cv2

In [102]:
df['DEPARTMENT'] = df['department']

In [103]:
df

        NAME DEPART COMPANY  ID department DEPARTMENT
0  gyanendra     cv      ab  55         cv         cv
1      utsav    cpp      bc  65        cpp        cpp
2    nripesh    cv2      cd  75        cv2        cv2

In [104]:
df.drop('department',axis = 1)

        NAME DEPART COMPANY  ID DEPARTMENT
0  gyanendra     cv      ab  55         cv
1      utsav    cpp      bc  65        cpp
2    nripesh    cv2      cd  75        cv2